cars = [1 1 2 1 2 3 1 2 3 4 1 2 3 4 5];

figure(1);
subplot(2,1,1);
hist(cars);
title('Гістограма кількості авто');
xlabel('Кількість авто за 10 хв');
ylabel('Частота');

subplot(2,1,2);
bar(cars);
title('Стовпчикова діаграма кількості авто');
xlabel('Інтервали часу (кожні 10 хв)');
ylabel('Кількість авто');



grades = [5 4 3 5 2 4 5 3 4 2 5 3 4 2 5];

figure(2);
subplot(2,1,1);
hist(grades);
title('Гістограма оцінок студентів');
xlabel('Оцінка');
ylabel('Кількість студентів');

subplot(2,1,2);
bar(grades);
title('Стовпчикова діаграма оцінок');
xlabel('Номер студента');
ylabel('Оцінка');
